Revit 2016 API
PointLoad.Moment Property
 Returns the three dimensional moment applied to the point load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use MomentVector instead.")]
public XYZ Moment { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use MomentVector instead.")> _
Public Property Moment As XYZ
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use MomentVector instead.")]
public:
property XYZ^ Moment {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 The default force unit is kN-m for metric, and kip-ft for imperial.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace